package First_Basic_Statistics;

public class Basic_Statistics
{
    /*
    기초 통계(Basic Statistics)

    목표 - 통계에 대한 기본 개념을 배우고 자료 정리 및 분석하는 방법과 그에 필요한 이론들을 알 수 있다.

    중간(30) + 기말(40) + 출석(15) + 태도(15) + 𝛼

    통계(Statistics)
    - 정보 또는 데이터를 규정하고 구성하며 해석하는데 사용되는 도구와 기법
    - 정보를 보다 쉽게 이해할 수 있도록 이를 체계화하고 분석하는 과학분야로서 앞선 연구들을 가능하게 하는 분야

    Class Contents
    - 통계학 기초 개념 및 주요 용어
    - Excel 수식과 함수를 사용하여 데이터 분석 도구로 사용

    Why Study?
    - 데이터 분석 및 빅데이터를 다루기 위한 개념적 체계 필요

    통계 수업에서 얻을 수 있는 것?
    - 전공을 이수하기 위해 필요한 과정
    - 취업에서 더 어렵고 더 많은 노력이 필요한 수업을 기꺼이 수강 할 의지가 있다는 것을 증명
    - 익숙하지 않은 지적인 도전
    - 사회 또는 행동과학 분야에서 더 나은 학생이 될 수 있음.
    - 교육, 인류학, 사회학, 생물학 등 다른 과학분야에서 통계 학습 과정을 통해 더 심화된 내용을 학습하는 기반.
    - 다른 유형의 문제에 대한 접근 방식에서 새로운 사고 방식은 바로 드러나지 않더라도 낯선 상황에서 발휘
    - 어려운 통계 입문 과정을 이수했다는 성취감

    통계학의 역사
    - 17C 부터 데이터가 본격적으로 수집

    Francis Galton(1822 ~ 1911)
    - 찰스 다윈(종의 기원 저자)의 사촌으로 가족 구성원간 지능의 유사성 연구를 위하여 상관계수(correlation coefficient)라는 수학적인 통계기법을 적용.
    - 20C초에 두 집단의 평균 조사로 통계 조사가 본격적으로 등장.
    - PC의 등장으로 excel 등 다양하고 정교해진 통계도구 등장
    - 사회과학, 행동과학, 생물학, 교육학, 간호학, 심리학, 농업, 천문학, 정치학 등 사회 전 분야에서 적용 확산
    - 최근 데이터 분석을 전문적으로 연구하는 분야 등장(Informatics)

    기술통계(desciptive statistics)
    - 수집된 데이터의 특성을 정리하고 설명하는 데 사용됨.

    가장 인기있는 전공이 무엇인지 기술(describe) 하면?
    기술통계값(최빈값 - mode)

    학생들의 평균 나이는?
    기술통계값(평균 - mean)

    추론 통계(inferential statistics)
    - 항상은 아니지만 대부분 데이터를 수집하고 요약한 다음의 단계
    - 소규모의 데이터를 기반으로 더 큰 규모의 데이터 집단(모집단)에 대하여 추론하는 데 사용
    - 소규모 데이터 집단은 흔히 표본 집단(sample)이라고 하는데, 이는 모집단(population)의 일부 또는 하위 집합.

    통계의 범위는 어디까지일까요?
    - 통계는 우리가 세상을 이해하는 데 도움을 주는 도구
    - 즉, 통계는 수집한 정보를 구성하고 그 데이터의 특성을 새로운 환경에서 어떻게 적용할 수 있는지에 대한 결론을 도출할 수 있게 도움으로써, 세상에 대한 정보를 제공
    - 기술통계와 추론통계는 상호보완적이며, 둘 중 어떤 통계를 언제 사용하는지는 답을 구하고자 하는 질문에 따라 결정됨.

    수식이란?
    - 특정 수학적 작업을 수행하는 수학 연산자들의 집합.

    수식 만들기
    1. 수식의 결과값을 표시할 셀을 선택함.
    2. 등호(=)를 입력함. 모든 수식은 그 내용과 관계없이 등호로 시작됨.
    3. 수식을 입력함. 수식에 공백은 넣으면 안됨. Excel은 공백을 좋아하지 않음.
    4. Enter를 누르면 수식의 결과 값이 선택된 셀에 나타남.

    몇 가지 기억해야 할 사항
    - 수식은 항상 등호로 시작함. 등호는 Excel에서 뒤에 나오는 내용이 수식이라는 것을 알려줌.
    - 수식 자체는 항상 수식 입력줄에 나타남.
    - 수식의 결과값(수식 자체는 아님)은 선택한 셀에 표시됨.

    더하기 +
    빼기 -
    나누기 /
    곱하기 *
    제곱하기 ^
     */





}
